I cannot recreate Magic Castle after a destroy. 

Same error as situation #1 above.  

```
vincelf@DESKTOP-5N9VHFK:~/vscode-workspaces/terraform-projects/magic_castle-openstack-release$ tf apply
module.openstack.data.external.keystone: Reading...
module.openstack.data.openstack_networking_subnet_v2.subnet: Reading...
module.openstack.data.openstack_compute_flavor_v2.flavors["login"]: Reading...
module.openstack.data.openstack_compute_flavor_v2.flavors["gpu-node"]: Reading...
module.openstack.data.openstack_images_image_v2.image["login"]: Reading...
module.openstack.data.openstack_images_image_v2.image["mgmt"]: Reading...
module.openstack.data.openstack_images_image_v2.image["gpu-node"]: Reading...
module.openstack.data.openstack_compute_flavor_v2.flavors["mgmt"]: Reading...
module.openstack.data.openstack_networking_network_v2.ext_network: Reading...
module.openstack.data.external.keystone: Read complete after 0s [id=-]
module.openstack.data.openstack_images_image_v2.image["gpu-node"]: Read complete after 1s [id=a269b23a-4033-4c20-8c96-00affd58bb41]
module.openstack.data.openstack_images_image_v2.image["login"]: Read complete after 1s [id=a269b23a-4033-4c20-8c96-00affd58bb41]
module.openstack.data.openstack_images_image_v2.image["mgmt"]: Read complete after 1s [id=a269b23a-4033-4c20-8c96-00affd58bb41]
module.openstack.data.openstack_networking_subnet_v2.subnet: Read complete after 2s [id=492f65ba-5a90-4245-874c-9ce7a338409c]
module.openstack.data.openstack_networking_network_v2.int_network: Reading...
module.openstack.data.openstack_networking_network_v2.ext_network: Read complete after 2s [id=6621bf61-6094-4b24-a9a0-f5794c3a881e]
module.openstack.data.openstack_compute_flavor_v2.flavors["mgmt"]: Read complete after 2s [id=d2e0247d-3869-4f17-b9d0-9735f4f1b57a]
module.openstack.data.openstack_compute_flavor_v2.flavors["gpu-node"]: Read complete after 2s [id=39d3041a-ace2-4166-9133-d78fe00190a9]
module.openstack.data.openstack_compute_flavor_v2.flavors["login"]: Read complete after 2s [id=6bc1a373-efc5-4234-a4ae-db70407cb594]
module.openstack.data.openstack_networking_network_v2.int_network: Read complete after 0s [id=28d08b0d-3fca-4df7-92a3-88c2eebb9583]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.openstack.openstack_blockstorage_volume_v3.volumes["mgmt1-nfs-home"] will be created
  + resource "openstack_blockstorage_volume_v3" "volumes" {
      + attachment        = (known after apply)
      + availability_zone = (known after apply)
      + description       = "phoenix mgmt1-nfs-home"
      + id                = (known after apply)
      + metadata          = (known after apply)
      + name              = "phoenix-mgmt1-nfs-home"
      + region            = (known after apply)
      + size              = 100
      + volume_type       = (known after apply)
    }

  # module.openstack.openstack_blockstorage_volume_v3.volumes["mgmt1-nfs-project"] will be created
  + resource "openstack_blockstorage_volume_v3" "volumes" {
      + attachment        = (known after apply)
      + availability_zone = (known after apply)
      + description       = "phoenix mgmt1-nfs-project"
      + id                = (known after apply)
      + metadata          = (known after apply)
      + name              = "phoenix-mgmt1-nfs-project"
      + region            = (known after apply)
      + size              = 50
      + volume_type       = (known after apply)
    }

  # module.openstack.openstack_blockstorage_volume_v3.volumes["mgmt1-nfs-scratch"] will be created
  + resource "openstack_blockstorage_volume_v3" "volumes" {
      + attachment        = (known after apply)
      + availability_zone = (known after apply)
      + description       = "phoenix mgmt1-nfs-scratch"
      + id                = (known after apply)
      + metadata          = (known after apply)
      + name              = "phoenix-mgmt1-nfs-scratch"
      + region            = (known after apply)
      + size              = 50
      + volume_type       = (known after apply)
    }

  # module.openstack.openstack_compute_floatingip_associate_v2.fip["login1"] will be created
  + resource "openstack_compute_floatingip_associate_v2" "fip" {
      + floating_ip = "206.12.89.223"
      + id          = (known after apply)
      + instance_id = (known after apply)
      + region      = (known after apply)
    }

  # module.openstack.openstack_compute_instance_v2.instances["gpu-node1"] will be created
  + resource "openstack_compute_instance_v2" "instances" {
      + access_ip_v4        = (known after apply)
      + access_ip_v6        = (known after apply)
      + all_metadata        = (known after apply)
      + all_tags            = (known after apply)
      + availability_zone   = (known after apply)
      + created             = (known after apply)
      + flavor_id           = (known after apply)
      + flavor_name         = "g1-8gb-c4-22gb"
      + force_delete        = false
      + id                  = (known after apply)
      + image_id            = "a269b23a-4033-4c20-8c96-00affd58bb41"
      + image_name          = (known after apply)
      + key_pair            = "phoenix-key"
      + name                = "phoenix-gpu-node1"
      + power_state         = "active"
      + region              = (known after apply)
      + security_groups     = (known after apply)
      + stop_before_destroy = false
      + updated             = (known after apply)
      + user_data           = (known after apply)

      + network {
          + access_network = false
          + fixed_ip_v4    = (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          + mac            = (known after apply)
          + name           = (known after apply)
          + port           = (known after apply)
          + uuid           = (known after apply)
        }
    }

  # module.openstack.openstack_compute_instance_v2.instances["login1"] will be created
  + resource "openstack_compute_instance_v2" "instances" {
      + access_ip_v4        = (known after apply)
      + access_ip_v6        = (known after apply)
      + all_metadata        = (known after apply)
      + all_tags            = (known after apply)
      + availability_zone   = (known after apply)
      + created             = (known after apply)
      + flavor_id           = (known after apply)
      + flavor_name         = "p2-3gb"
      + force_delete        = false
      + id                  = (known after apply)
      + image_id            = "a269b23a-4033-4c20-8c96-00affd58bb41"
      + image_name          = (known after apply)
      + key_pair            = "phoenix-key"
      + name                = "phoenix-login1"
      + power_state         = "active"
      + region              = (known after apply)
      + security_groups     = (known after apply)
      + stop_before_destroy = false
      + updated             = (known after apply)
      + user_data           = (known after apply)

      + network {
          + access_network = false
          + fixed_ip_v4    = (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          + mac            = (known after apply)
          + name           = (known after apply)
          + port           = (known after apply)
          + uuid           = (known after apply)
        }
    }

  # module.openstack.openstack_compute_instance_v2.instances["mgmt1"] will be created
  + resource "openstack_compute_instance_v2" "instances" {
      + access_ip_v4        = (known after apply)
      + access_ip_v6        = (known after apply)
      + all_metadata        = (known after apply)
      + all_tags            = (known after apply)
      + availability_zone   = (known after apply)
      + created             = (known after apply)
      + flavor_id           = (known after apply)
      + flavor_name         = "p4-6gb"
      + force_delete        = false
      + id                  = (known after apply)
      + image_id            = "a269b23a-4033-4c20-8c96-00affd58bb41"
      + image_name          = (known after apply)
      + key_pair            = "phoenix-key"
      + name                = "phoenix-mgmt1"
      + power_state         = "active"
      + region              = (known after apply)
      + security_groups     = (known after apply)
      + stop_before_destroy = false
      + updated             = (known after apply)
      + user_data           = (known after apply)

      + network {
          + access_network = false
          + fixed_ip_v4    = (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          + mac            = (known after apply)
          + name           = (known after apply)
          + port           = (known after apply)
          + uuid           = (known after apply)
        }
    }

  # module.openstack.openstack_compute_keypair_v2.keypair will be created
  + resource "openstack_compute_keypair_v2" "keypair" {
      + fingerprint = (known after apply)
      + id          = (known after apply)
      + name        = "phoenix-key"
      + private_key = (known after apply)
      + public_key  = <<-EOT
            ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQDJWmbIQYhvjdGJ7vOgeOTmlyRzHwBef5QgJfg2Y8b5FgN2NYrCF3Vz2cklWliU3vx/e67kRl+QpRDJ0Xi4FKzogeJ+3Z+Tj7zhutfc1a4pvrtFKT8NN3uktAP8V+lhOQRgO3Xj3riI0ybuNbpBoOaNRJosNCWBDWqZatvJxU7cIoePTR7MAh7MuLh3b3ruaAJu4DUBWJEIhIO7ERH9jiJ3piGGEOFun0w+l0pyqv5fDdDZ8iz3sw3w3ZIS4rj8MZYDQj+H72nF1YBGDDRzYNjvZqF3t3NhPNhYUou8brQEe7iSWKm4CW3ffrKP1QUngn1EvzEN2d8L+m/4p04PxpWbOH+XFr3YAgR8zWlNbo1lYLwhNyoiXCXMBZgkgeK+yFpQUnunoVnYWxpd/i1wFecGSUbVH1ZG6zC7sH4Nc+4F9GVdDHwq+WG7YqNDqghecOdL7MAhSUaFmyhN+28Z1z6yGNnkn9BGfTSF3OVQ1Ukv0gfii/ztH4y/dORJLd1u0KEf1omrBlIvBykV0Gek+lTxFYHpZWHRMQSZgg7/hZRRGej0WGgwa1hO+vnN8Wm6F9cyx8i19X9FzuH/zjqugq94FV7Pw29fMvFcHfFno3higumwCTy7jTaB8jxp9EbN4yIkCqjveHXczSxqEgtpPZagU6QjYULgqe7RjPC1sg1z6Q== vincelf@DESKTOP-5N9VHFK
        EOT
      + region      = (known after apply)
      + user_id     = (known after apply)
    }

  # module.openstack.openstack_compute_secgroup_v2.secgroup will be created
  + resource "openstack_compute_secgroup_v2" "secgroup" {
      + description = "phoenix security group"
      + id          = (known after apply)
      + name        = "phoenix-secgroup"
      + region      = (known after apply)

      + rule {
          + from_port   = -1
          + id          = (known after apply)
          + ip_protocol = "icmp"
          + self        = true
          + to_port     = -1
        }
      + rule {
          + from_port   = 1
          + id          = (known after apply)
          + ip_protocol = "tcp"
          + self        = true
          + to_port     = 65535
        }
      + rule {
          + from_port   = 1
          + id          = (known after apply)
          + ip_protocol = "udp"
          + self        = true
          + to_port     = 65535
        }
      + rule {
          + cidr        = "0.0.0.0/0"
          + from_port   = 22
          + id          = (known after apply)
          + ip_protocol = "tcp"
          + self        = false
          + to_port     = 22
        }
      + rule {
          + cidr        = "0.0.0.0/0"
          + from_port   = 443
          + id          = (known after apply)
          + ip_protocol = "tcp"
          + self        = false
          + to_port     = 443
        }
      + rule {
          + cidr        = "0.0.0.0/0"
          + from_port   = 50000
          + id          = (known after apply)
          + ip_protocol = "tcp"
          + self        = false
          + to_port     = 51000
        }
      + rule {
          + cidr        = "0.0.0.0/0"
          + from_port   = 7512
          + id          = (known after apply)
          + ip_protocol = "tcp"
          + self        = false
          + to_port     = 7512
        }
      + rule {
          + cidr        = "0.0.0.0/0"
          + from_port   = 80
          + id          = (known after apply)
          + ip_protocol = "tcp"
          + self        = false
          + to_port     = 80
        }
      + rule {
          + cidr        = "54.237.254.192/29"
          + from_port   = 2811
          + id          = (known after apply)
          + ip_protocol = "tcp"
          + self        = false
          + to_port     = 2811
        }
    }

  # module.openstack.openstack_compute_volume_attach_v2.attachments["mgmt1-nfs-home"] will be created
  + resource "openstack_compute_volume_attach_v2" "attachments" {
      + device      = (known after apply)
      + id          = (known after apply)
      + instance_id = (known after apply)
      + region      = (known after apply)
      + volume_id   = (known after apply)
    }

  # module.openstack.openstack_compute_volume_attach_v2.attachments["mgmt1-nfs-project"] will be created
  + resource "openstack_compute_volume_attach_v2" "attachments" {
      + device      = (known after apply)
      + id          = (known after apply)
      + instance_id = (known after apply)
      + region      = (known after apply)
      + volume_id   = (known after apply)
    }

  # module.openstack.openstack_compute_volume_attach_v2.attachments["mgmt1-nfs-scratch"] will be created
  + resource "openstack_compute_volume_attach_v2" "attachments" {
      + device      = (known after apply)
      + id          = (known after apply)
      + instance_id = (known after apply)
      + region      = (known after apply)
      + volume_id   = (known after apply)
    }

  # module.openstack.openstack_networking_port_v2.nic["gpu-node1"] will be created
  + resource "openstack_networking_port_v2" "nic" {
      + admin_state_up         = (known after apply)
      + all_fixed_ips          = (known after apply)
      + all_security_group_ids = (known after apply)
      + all_tags               = (known after apply)
      + device_id              = (known after apply)
      + device_owner           = (known after apply)
      + dns_assignment         = (known after apply)
      + dns_name               = (known after apply)
      + id                     = (known after apply)
      + mac_address            = (known after apply)
      + name                   = "phoenix-gpu-node1-port"
      + network_id             = "28d08b0d-3fca-4df7-92a3-88c2eebb9583"
      + port_security_enabled  = true
      + qos_policy_id          = (known after apply)
      + region                 = (known after apply)
      + security_group_ids     = (known after apply)
      + tenant_id              = (known after apply)

      + binding {
          + host_id     = (known after apply)
          + profile     = (known after apply)
          + vif_details = (known after apply)
          + vif_type    = (known after apply)
          + vnic_type   = (known after apply)
        }

      + fixed_ip {
          + subnet_id = "492f65ba-5a90-4245-874c-9ce7a338409c"
        }
    }

  # module.openstack.openstack_networking_port_v2.nic["login1"] will be created
  + resource "openstack_networking_port_v2" "nic" {
      + admin_state_up         = (known after apply)
      + all_fixed_ips          = (known after apply)
      + all_security_group_ids = (known after apply)
      + all_tags               = (known after apply)
      + device_id              = (known after apply)
      + device_owner           = (known after apply)
      + dns_assignment         = (known after apply)
      + dns_name               = (known after apply)
      + id                     = (known after apply)
      + mac_address            = (known after apply)
      + name                   = "phoenix-login1-port"
      + network_id             = "28d08b0d-3fca-4df7-92a3-88c2eebb9583"
      + port_security_enabled  = true
      + qos_policy_id          = (known after apply)
      + region                 = (known after apply)
      + security_group_ids     = (known after apply)
      + tenant_id              = (known after apply)

      + binding {
          + host_id     = (known after apply)
          + profile     = (known after apply)
          + vif_details = (known after apply)
          + vif_type    = (known after apply)
          + vnic_type   = (known after apply)
        }

      + fixed_ip {
          + subnet_id = "492f65ba-5a90-4245-874c-9ce7a338409c"
        }
    }

  # module.openstack.openstack_networking_port_v2.nic["mgmt1"] will be created
  + resource "openstack_networking_port_v2" "nic" {
      + admin_state_up         = (known after apply)
      + all_fixed_ips          = (known after apply)
      + all_security_group_ids = (known after apply)
      + all_tags               = (known after apply)
      + device_id              = (known after apply)
      + device_owner           = (known after apply)
      + dns_assignment         = (known after apply)
      + dns_name               = (known after apply)
      + id                     = (known after apply)
      + mac_address            = (known after apply)
      + name                   = "phoenix-mgmt1-port"
      + network_id             = "28d08b0d-3fca-4df7-92a3-88c2eebb9583"
      + port_security_enabled  = true
      + qos_policy_id          = (known after apply)
      + region                 = (known after apply)
      + security_group_ids     = (known after apply)
      + tenant_id              = (known after apply)

      + binding {
          + host_id     = (known after apply)
          + profile     = (known after apply)
          + vif_details = (known after apply)
          + vif_type    = (known after apply)
          + vnic_type   = (known after apply)
        }

      + fixed_ip {
          + subnet_id = "492f65ba-5a90-4245-874c-9ce7a338409c"
        }
    }

  # module.openstack.module.cluster_config.null_resource.deploy_hieradata[0] will be created
  + resource "null_resource" "deploy_hieradata" {
      + id       = (known after apply)
      + triggers = {
          + "facts"        = "037bfb9b9f4e36bc1b606daef1817b8c"
          + "hieradata"    = (known after apply)
          + "puppetserver" = (known after apply)
          + "user_data"    = "9efc314b65237d5d646e1b817372afc6"
        }
    }

  # module.openstack.module.cluster_config.random_pet.guest_passwd[0] will be created
  + resource "random_pet" "guest_passwd" {
      + id        = (known after apply)
      + length    = 4
      + separator = "."
    }

  # module.openstack.module.instance_config.random_string.puppetserver_password will be created
  + resource "random_string" "puppetserver_password" {
      + id          = (known after apply)
      + length      = 32
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = true
    }

  # module.openstack.module.instance_config.tls_private_key.ed25519_hostkeys["gpu-node"] will be created
  + resource "tls_private_key" "ed25519_hostkeys" {
      + algorithm                     = "ED25519"
      + ecdsa_curve                   = "P224"
      + id                            = (known after apply)
      + private_key_openssh           = (sensitive value)
      + private_key_pem               = (sensitive value)
      + private_key_pem_pkcs8         = (sensitive value)
      + public_key_fingerprint_md5    = (known after apply)
      + public_key_fingerprint_sha256 = (known after apply)
      + public_key_openssh            = (known after apply)
      + public_key_pem                = (known after apply)
      + rsa_bits                      = 2048
    }

  # module.openstack.module.instance_config.tls_private_key.ed25519_hostkeys["login"] will be created
  + resource "tls_private_key" "ed25519_hostkeys" {
      + algorithm                     = "ED25519"
      + ecdsa_curve                   = "P224"
      + id                            = (known after apply)
      + private_key_openssh           = (sensitive value)
      + private_key_pem               = (sensitive value)
      + private_key_pem_pkcs8         = (sensitive value)
      + public_key_fingerprint_md5    = (known after apply)
      + public_key_fingerprint_sha256 = (known after apply)
      + public_key_openssh            = (known after apply)
      + public_key_pem                = (known after apply)
      + rsa_bits                      = 2048
    }

  # module.openstack.module.instance_config.tls_private_key.ed25519_hostkeys["mgmt"] will be created
  + resource "tls_private_key" "ed25519_hostkeys" {
      + algorithm                     = "ED25519"
      + ecdsa_curve                   = "P224"
      + id                            = (known after apply)
      + private_key_openssh           = (sensitive value)
      + private_key_pem               = (sensitive value)
      + private_key_pem_pkcs8         = (sensitive value)
      + public_key_fingerprint_md5    = (known after apply)
      + public_key_fingerprint_sha256 = (known after apply)
      + public_key_openssh            = (known after apply)
      + public_key_pem                = (known after apply)
      + rsa_bits                      = 2048
    }

  # module.openstack.module.instance_config.tls_private_key.rsa_hostkeys["gpu-node"] will be created
  + resource "tls_private_key" "rsa_hostkeys" {
      + algorithm                     = "RSA"
      + ecdsa_curve                   = "P224"
      + id                            = (known after apply)
      + private_key_openssh           = (sensitive value)
      + private_key_pem               = (sensitive value)
      + private_key_pem_pkcs8         = (sensitive value)
      + public_key_fingerprint_md5    = (known after apply)
      + public_key_fingerprint_sha256 = (known after apply)
      + public_key_openssh            = (known after apply)
      + public_key_pem                = (known after apply)
      + rsa_bits                      = 4096
    }

  # module.openstack.module.instance_config.tls_private_key.rsa_hostkeys["login"] will be created
  + resource "tls_private_key" "rsa_hostkeys" {
      + algorithm                     = "RSA"
      + ecdsa_curve                   = "P224"
      + id                            = (known after apply)
      + private_key_openssh           = (sensitive value)
      + private_key_pem               = (sensitive value)
      + private_key_pem_pkcs8         = (sensitive value)
      + public_key_fingerprint_md5    = (known after apply)
      + public_key_fingerprint_sha256 = (known after apply)
      + public_key_openssh            = (known after apply)
      + public_key_pem                = (known after apply)
      + rsa_bits                      = 4096
    }

  # module.openstack.module.instance_config.tls_private_key.rsa_hostkeys["mgmt"] will be created
  + resource "tls_private_key" "rsa_hostkeys" {
      + algorithm                     = "RSA"
      + ecdsa_curve                   = "P224"
      + id                            = (known after apply)
      + private_key_openssh           = (sensitive value)
      + private_key_pem               = (sensitive value)
      + private_key_pem_pkcs8         = (sensitive value)
      + public_key_fingerprint_md5    = (known after apply)
      + public_key_fingerprint_sha256 = (known after apply)
      + public_key_openssh            = (known after apply)
      + public_key_pem                = (known after apply)
      + rsa_bits                      = 4096
    }

Plan: 24 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + accounts  = {
      + guests = {
          + password  = (known after apply)
          + usernames = "user[1-2]"
        }
      + sudoer = {
          + password = "N/A (public ssh-key auth)"
          + username = "centos"
        }
    }
  + public_ip = {
      + login1 = "206.12.89.223"
    }

Do you want to perform these actions in workspace "alliancecan-ivado-magic_castle-ca-east"?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes
```

```
  Enter a value: yes

module.openstack.module.cluster_config.random_pet.guest_passwd[0]: Creating...
module.openstack.module.instance_config.random_string.puppetserver_password: Creating...
module.openstack.module.cluster_config.random_pet.guest_passwd[0]: Creation complete after 0s [id=directly.rapidly.national.poodle]
module.openstack.module.instance_config.random_string.puppetserver_password: Creation complete after 0s [id=wqMPnsKQjjxbzGM35c2CHryA99z4lBbi]
module.openstack.module.instance_config.tls_private_key.ed25519_hostkeys["mgmt"]: Creating...
module.openstack.module.instance_config.tls_private_key.ed25519_hostkeys["gpu-node"]: Creating...
module.openstack.module.instance_config.tls_private_key.rsa_hostkeys["login"]: Creating...
module.openstack.module.instance_config.tls_private_key.ed25519_hostkeys["login"]: Creating...
module.openstack.module.instance_config.tls_private_key.rsa_hostkeys["mgmt"]: Creating...
module.openstack.module.instance_config.tls_private_key.rsa_hostkeys["gpu-node"]: Creating...
module.openstack.module.instance_config.tls_private_key.ed25519_hostkeys["mgmt"]: Creation complete after 0s [id=1ebb09caa4e66f3da1f489e30505637f64dd67b3]
module.openstack.module.instance_config.tls_private_key.ed25519_hostkeys["login"]: Creation complete after 0s [id=054cb8451800b6c17b643fb2964e172597045568]
module.openstack.module.instance_config.tls_private_key.ed25519_hostkeys["gpu-node"]: Creation complete after 0s [id=7e0a3661db36f8ae917a2cc7bfbfd0560243b7b0]
module.openstack.openstack_compute_keypair_v2.keypair: Creating...
module.openstack.openstack_blockstorage_volume_v3.volumes["mgmt1-nfs-project"]: Creating...
module.openstack.openstack_blockstorage_volume_v3.volumes["mgmt1-nfs-scratch"]: Creating...
module.openstack.openstack_blockstorage_volume_v3.volumes["mgmt1-nfs-home"]: Creating...
module.openstack.openstack_compute_secgroup_v2.secgroup: Creating...
module.openstack.module.instance_config.tls_private_key.rsa_hostkeys["login"]: Creation complete after 0s [id=263b88aceae4d6f110fe5dfaf55eb5c533d7ce95]
module.openstack.module.instance_config.tls_private_key.rsa_hostkeys["mgmt"]: Creation complete after 1s [id=58c89b74b9c11902523db6c43b33143c3c0bbc64]
module.openstack.module.instance_config.tls_private_key.rsa_hostkeys["gpu-node"]: Creation complete after 1s [id=e189ed87db7207f9027b5debfc80b6307972c130]
module.openstack.openstack_compute_keypair_v2.keypair: Creation complete after 1s [id=phoenix-key]
module.openstack.openstack_blockstorage_volume_v3.volumes["mgmt1-nfs-project"]: Still creating... [10s elapsed]
module.openstack.openstack_blockstorage_volume_v3.volumes["mgmt1-nfs-scratch"]: Still creating... [10s elapsed]
module.openstack.openstack_blockstorage_volume_v3.volumes["mgmt1-nfs-home"]: Still creating... [10s elapsed]
module.openstack.openstack_compute_secgroup_v2.secgroup: Still creating... [10s elapsed]
module.openstack.openstack_blockstorage_volume_v3.volumes["mgmt1-nfs-scratch"]: Creation complete after 12s [id=a458ab29-e67e-4c59-a385-27b97075a6bc]
module.openstack.openstack_blockstorage_volume_v3.volumes["mgmt1-nfs-home"]: Creation complete after 12s [id=40170849-75f6-4c33-8870-7659ae72efa4]
module.openstack.openstack_blockstorage_volume_v3.volumes["mgmt1-nfs-project"]: Creation complete after 12s [id=a424968a-f366-4c24-9be7-53d86f4627c6]
module.openstack.openstack_compute_secgroup_v2.secgroup: Creation complete after 14s [id=8b96ad17-895e-4595-ad8f-ecd7d92e436c]
module.openstack.openstack_networking_port_v2.nic["login1"]: Creating...
module.openstack.openstack_networking_port_v2.nic["mgmt1"]: Creating...
module.openstack.openstack_networking_port_v2.nic["gpu-node1"]: Creating...
module.openstack.openstack_networking_port_v2.nic["gpu-node1"]: Creation complete after 8s [id=d0fe0ac3-6ab4-4c4d-8e0c-46190bdf6bf4]
module.openstack.openstack_networking_port_v2.nic["login1"]: Creation complete after 8s [id=68493636-3f72-4503-9542-0334f27f3070]
module.openstack.openstack_networking_port_v2.nic["mgmt1"]: Creation complete after 9s [id=5a4d9cc8-79b4-4b64-af14-b1e65120d5fc]
module.openstack.openstack_compute_instance_v2.instances["gpu-node1"]: Creating...
module.openstack.openstack_compute_instance_v2.instances["login1"]: Creating...
module.openstack.openstack_compute_instance_v2.instances["mgmt1"]: Creating...
module.openstack.openstack_compute_instance_v2.instances["login1"]: Still creating... [10s elapsed]
module.openstack.openstack_compute_instance_v2.instances["gpu-node1"]: Still creating... [10s elapsed]
module.openstack.openstack_compute_instance_v2.instances["mgmt1"]: Still creating... [10s elapsed]
module.openstack.openstack_compute_instance_v2.instances["mgmt1"]: Still creating... [20s elapsed]
module.openstack.openstack_compute_instance_v2.instances["login1"]: Still creating... [20s elapsed]
module.openstack.openstack_compute_instance_v2.instances["gpu-node1"]: Still creating... [20s elapsed]
module.openstack.openstack_compute_instance_v2.instances["login1"]: Still creating... [30s elapsed]
module.openstack.openstack_compute_instance_v2.instances["gpu-node1"]: Still creating... [30s elapsed]
module.openstack.openstack_compute_instance_v2.instances["mgmt1"]: Still creating... [30s elapsed]
module.openstack.openstack_compute_instance_v2.instances["gpu-node1"]: Creation complete after 37s [id=6e89ffe1-0422-4e65-bb7a-c744d349b2ca]
module.openstack.openstack_compute_instance_v2.instances["mgmt1"]: Still creating... [40s elapsed]
module.openstack.openstack_compute_instance_v2.instances["login1"]: Still creating... [40s elapsed]
module.openstack.openstack_compute_instance_v2.instances["login1"]: Creation complete after 48s [id=9271df85-c5b1-44c2-8dec-5f70baaf8a3b]
module.openstack.openstack_compute_instance_v2.instances["mgmt1"]: Still creating... [50s elapsed]
module.openstack.openstack_compute_instance_v2.instances["mgmt1"]: Creation complete after 58s [id=fff9051c-1b2a-4823-a996-0cf3cfc8377d]
module.openstack.openstack_compute_volume_attach_v2.attachments["mgmt1-nfs-scratch"]: Creating...
module.openstack.openstack_compute_volume_attach_v2.attachments["mgmt1-nfs-project"]: Creating...
module.openstack.openstack_compute_floatingip_associate_v2.fip["login1"]: Creating...
module.openstack.openstack_compute_volume_attach_v2.attachments["mgmt1-nfs-home"]: Creating...
module.openstack.module.cluster_config.null_resource.deploy_hieradata[0]: Creating...
module.openstack.module.cluster_config.null_resource.deploy_hieradata[0]: Provisioning with 'file'...
module.openstack.openstack_compute_floatingip_associate_v2.fip["login1"]: Creation complete after 5s [id=206.12.89.223/9271df85-c5b1-44c2-8dec-5f70baaf8a3b/]
module.openstack.openstack_compute_volume_attach_v2.attachments["mgmt1-nfs-home"]: Creation complete after 7s [id=fff9051c-1b2a-4823-a996-0cf3cfc8377d/40170849-75f6-4c33-8870-7659ae72efa4]
module.openstack.openstack_compute_volume_attach_v2.attachments["mgmt1-nfs-scratch"]: Creation complete after 8s [id=fff9051c-1b2a-4823-a996-0cf3cfc8377d/a458ab29-e67e-4c59-a385-27b97075a6bc]
module.openstack.module.cluster_config.null_resource.deploy_hieradata[0]: Still creating... [10s elapsed]
module.openstack.openstack_compute_volume_attach_v2.attachments["mgmt1-nfs-project"]: Still creating... [10s elapsed]
module.openstack.openstack_compute_volume_attach_v2.attachments["mgmt1-nfs-project"]: Creation complete after 11s [id=fff9051c-1b2a-4823-a996-0cf3cfc8377d/a424968a-f366-4c24-9be7-53d86f4627c6]
module.openstack.module.cluster_config.null_resource.deploy_hieradata[0]: Still creating... [20s elapsed]
module.openstack.module.cluster_config.null_resource.deploy_hieradata[0]: Still creating... [30s elapsed]
module.openstack.module.cluster_config.null_resource.deploy_hieradata[0]: Still creating... [40s elapsed]
module.openstack.module.cluster_config.null_resource.deploy_hieradata[0]: Still creating... [50s elapsed]
module.openstack.module.cluster_config.null_resource.deploy_hieradata[0]: Still creating... [1m0s elapsed]
module.openstack.module.cluster_config.null_resource.deploy_hieradata[0]: Still creating... [1m10s elapsed]
module.openstack.module.cluster_config.null_resource.deploy_hieradata[0]: Still creating... [1m20s elapsed]
module.openstack.module.cluster_config.null_resource.deploy_hieradata[0]: Still creating... [1m30s elapsed]
module.openstack.module.cluster_config.null_resource.deploy_hieradata[0]: Still creating... [1m40s elapsed]
module.openstack.module.cluster_config.null_resource.deploy_hieradata[0]: Still creating... [1m51s elapsed]
module.openstack.module.cluster_config.null_resource.deploy_hieradata[0]: Still creating... [2m1s elapsed]
module.openstack.module.cluster_config.null_resource.deploy_hieradata[0]: Still creating... [2m11s elapsed]
module.openstack.module.cluster_config.null_resource.deploy_hieradata[0]: Still creating... [2m21s elapsed]
module.openstack.module.cluster_config.null_resource.deploy_hieradata[0]: Still creating... [2m31s elapsed]
module.openstack.module.cluster_config.null_resource.deploy_hieradata[0]: Still creating... [2m41s elapsed]

module.openstack.module.cluster_config.null_resource.deploy_hieradata[0]: Still creating... [2m51s elapsed]
module.openstack.module.cluster_config.null_resource.deploy_hieradata[0]: Still creating... [3m1s elapsed]
module.openstack.module.cluster_config.null_resource.deploy_hieradata[0]: Still creating... [3m11s elapsed]
module.openstack.module.cluster_config.null_resource.deploy_hieradata[0]: Still creating... [3m21s elapsed]
module.openstack.module.cluster_config.null_resource.deploy_hieradata[0]: Still creating... [3m31s elapsed]
module.openstack.module.cluster_config.null_resource.deploy_hieradata[0]: Still creating... [3m41s elapsed]
module.openstack.module.cluster_config.null_resource.deploy_hieradata[0]: Still creating... [3m51s elapsed]
module.openstack.module.cluster_config.null_resource.deploy_hieradata[0]: Still creating... [4m1s elapsed]
module.openstack.module.cluster_config.null_resource.deploy_hieradata[0]: Still creating... [4m11s elapsed]
module.openstack.module.cluster_config.null_resource.deploy_hieradata[0]: Still creating... [4m21s elapsed]
module.openstack.module.cluster_config.null_resource.deploy_hieradata[0]: Still creating... [4m31s elapsed]
module.openstack.module.cluster_config.null_resource.deploy_hieradata[0]: Still creating... [4m41s elapsed]
module.openstack.module.cluster_config.null_resource.deploy_hieradata[0]: Still creating... [4m51s elapsed]
╷
│ Error: file provisioner error
│ 
│   with module.openstack.module.cluster_config.null_resource.deploy_hieradata[0],
│   on common/cluster_config/main.tf line 59, in resource "null_resource" "deploy_hieradata":
│   59:   provisioner "file" {
│ 
│ timeout - last error: Error connecting to bastion: ssh: handshake failed: ssh: unable to authenticate, attempted methods [none], no supported methods remain
╵
```